#include <stdio.h>
int main(void)
{
    int num;

    printf("    n    n cubed\n");
    for(num = 1;num <= 6; num++)
        printf("%5d %5d\n",num,num*num*num);

        return 0;
} 
/*
1.第三个表达式可以使用递减符来递减计算器
2.可以改变第三个表达式,让计算器每次递增不同的数
3.可以用字符代替数字计算,因为字符在计算机里本质是以数字形式存储
//但并不意味着,可以将字符和数字进行比大小,无意义
4.可以通过改变第二个表达式来达到与上述相同的效果
for(num = 1;num*num*num<=216;num++)
5.可以让递增的量几何增长,而不是算数增长,也就是说,第三个表达式每次都乘上而不是加上一个固定的量
6.第三个表达式无论是什么合法表达式,每次迭代都会运行一次
7.可以省略一个或多个表达式(第二个不能省略,省略了就会被视为真,然后一直循环),但是不能省略分号,只要是在循环中具有能够结束循环的条件就行
8.在执行其他循环之前,只对第一个表达式求值一次或执行一次;
9.循环体中的行为可以改变循环头中的表达式
大致形式
for(最初只执行一次;条件测试;数据更新)
    {
    循环内容
    }
*/